iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_can.c
    return RT_EOK;
}

static int _can_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t box_num)
{
    uint32_t hcan;
    hcan = ((struct gd32_can *)(can->parent.user_data))->CanHandle;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;
    can_trasnmit_message_struct txheader = {0};
    /* Check the parameters */
    RT_ASSERT(pmsg->len <= 0x08);

    if (RT_CAN_STDID == pmsg->ide)
    {
        txheader.tx_ff = CAN_ID_STD;
        RT_ASSERT(IS_CAN_STDID(pmsg->id));
        txheader.tx_sfid = pmsg->id;
    }
    else
    {
        txheader.tx_ff = CAN_ID_EXT;
        RT_ASSERT(IS_CAN_EXTID(pmsg->id));
        txheader.tx_efid = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        txheader.tx_ft = CAN_RTR_DATA;
    }
    else
    {
        txheader.tx_ft = CAN_RTR_REMOTE;
    }
    txheader.tx_dlen = pmsg->len;
    rt_memcpy(txheader.tx_data, pmsg->data, txheader.tx_dlen);
    can_message_transmit(hcan, &txheader);
    return RT_EOK;
}

static int _can_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t fifo)
{
    uint8_t len;
    uint32_t hcan;
    struct rt_can_msg *pmsg;

    can_receive_message_struct rxmsg = {0};
    RT_ASSERT(can);

    hcan = ((struct gd32_can *)can->parent.user_data)->CanHandle;
    pmsg = (struct rt_can_msg *) buf;

    /* get data */
    can_message_receive(hcan, fifo, &rxmsg);
    if (rxmsg.rx_dlen == len)
        return -RT_ERROR;
    /* get id */
    if (CAN_ID_STD == rxmsg.rx_ff)
    {
        pmsg->ide = RT_CAN_STDID;
        pmsg->id = rxmsg.rx_sfid;
    }
    else
    {
        pmsg->ide = RT_CAN_EXTID;
        pmsg->id = rxmsg.rx_efid;
    }
    /* get type */
    if (CAN_RTR_DATA == rxmsg.rx_ft)
    {
        pmsg->rtr = RT_CAN_DTR;
    }
    else
    {
        pmsg->rtr = RT_CAN_RTR;
    }
    /* get len */
    pmsg->len = rxmsg.rx_dlen;
    rt_memcpy(pmsg->data, rxmsg.rx_data, rxmsg.rx_dlen);
    /* get hdr */
    if (hcan == CAN0)
    {
        //pmsg->hdr = (rxmsg.FI + 1) >> 1;
    }
#ifdef RT_USING_CAN1
    else if (hcan == CAN1)
    {
       //pmsg->hdr = (rxmsg.FI>> 1) + 14;
    }
#endif

    return RT_EOK;
}


static const struct rt_can_ops _can_ops =
{
    _can_config,
    _can_control,
    _can_sendmsg,
    _can_recvmsg,
};

static void _can_rx_isr(struct rt_can_device *can, rt_uint32_t fifo)
{
    uint32_t hcan;
    RT_ASSERT(can);
    hcan = ((struct gd32_can *) can->parent.user_data)->CanHandle;

    switch (fifo)
    {
    case CAN_RX_FIFO0:
        /* Check Overrun flag for FIFO0 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFO0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFO0);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (can_receive_message_length_get(hcan, CAN_FIFO0))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }

        /* Check FULL flag for FIFO0 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFF0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFF0);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND| fifo << 8);
        }
        break;
    case CAN_RX_FIFO1:
        /* Check Overrun flag for FIFO1 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFO1))
        {
            /* Clear FIFO1 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFO1);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (can_receive_message_length_get(hcan, CAN_FIFO1))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }

        /* Check FULL flag for FIFO1 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFF1))
        {
            /* Clear FIFO1 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFF1);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND| fifo << 8);
        }
        break;
    }
}

#ifdef RT_USING_CAN0
/**
 * @brief This function handles CAN1 TX interrupts. transmit fifo0/1/2 is empty can trigger this interrupt
 */
void USBD_HP_CAN0_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    uint32_t hcan;
    hcan = drv_can0.CanHandle;

    if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF0_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR0_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 0 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF0_FINISH);
    }
    else if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF1_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR1_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 1 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF1_FINISH);
    }
    else if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTF2_FINISH))
    {
        if (IS_BIT_SET(hcan->TSTR, CAN_IT_MTFNERR2_FINISH))
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 2 << 8);
        }
        else
        {
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        SET_BIT(hcan->TSTR, CAN_IT_MTF2_FINISH);
    }
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX0 interrupts.
 */
void USBD_LP_CAN0_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX1 interrupts.
 */
void CAN0_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 EWMC interrupts.
 */
void CAN0_EWMC_IRQHandler(void)
{
    rt_uint32_t errtype;
    uint32_t hcan;

    hcan = drv_can0.CanHandle;
    errtype = hcan->ER;

	rt_kprintf("err--------, errtype=%x\n", errtype);
    rt_interrupt_enter();
#if 0
    HAL_CAN_IRQHandler(hcan);

